Repository: dorex96/flutter_app_cibo
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, sv

# containerListPageTitle
source: Containers in Fridge
de: Behälter im Kühlschrank
es: Contenedores en el Frigorífico
fr: Conteneurs dans le Réfrigérateur
it: Contenitori in Frigo
sv: Behållare i kylen

# containerDetailNewTitle
source: New Container
de: Neuer Behälter
es: Nuevo Contenedor
fr: Nouveau Conteneur
it: Nuovo Contenitore
sv: Ny behållare

# containerDetailEditTitle
source: Edit Container
de: Behälter bearbeiten
es: Editar Contenedor
fr: Modifier Conteneur
it: Modifica Contenitore
sv: Redigera behållare

# containerDetailNameLabel
source: Container Name
de: Behältername
es: Nombre del Contenedor
fr: Nom du Conteneur
it: Nome Contenitore
sv: Behållarens namn

# containerDetailContainerWeightLabel
source: Container Weight (g)
de: Behältergewicht (g)
es: Peso del Contenedor (g)
fr: Poids du Conteneur (g)
it: Peso Contenitore (g)
sv: Behållarens vikt (g)

# containerDetailTotalWeightLabel
source: Total Weight (g)
de: Gesamtgewicht (g)
es: Peso Total (g)
fr: Poids Total (g)
it: Peso Totale (g)
sv: Total vikt (g)

# containerDetailFoodWeightLabel
source: Food Weight (g)
de: Lebensmittelgewicht (g)
es: Peso del Alimento (g)
fr: Poids de l'Aliment (g)
it: Peso Cibo (g)
sv: Matens vikt (g)

# containerDetailPortionLabel
source: Portion
es: Porción
it: Porzione

# containerDetailPortionWeightLabel
source: Portion Weight (g)
de: Portionsgewicht (g)
es: Peso de la Porción (g)
fr: Poids de la Portion (g)
it: Peso Porzione (g)
sv: Portionsvikt (g)

# containerDetailSaveButton
source: Save Container
de: Behälter speichern
es: Guardar Contenedor
fr: Enregistrer Conteneur
it: Salva Contenitore
sv: Spara behållare

# containerPortionWeight
source: Portion: {portion} g
es: Porción: {portion} g
it: Porzione: {portion} g

# containerNrPortion
source: N. Portions: {nrPortion}
de: Anzahl Portionen: {nrPortion}
es: N. Porciones: {nrPortion}
it: N. Porzioni: {nrPortion}
sv: Antal portioner: {nrPortion}

# containerUploadDate
source: Upload Date: {date}
de: Uploaddatum: {date}
es: Fecha de Carga: {date}
fr: Date de Téléchargement: {date}
it: Data Caricamento: {date}
sv: Uppladdningsdatum: {date}

# gen_No_Food
source: You have nothing to eat ðŸ˜¢
de: Du hast nichts zu essen 😢
es: No tienes nada que comer
fr: Tu n'as rien à manger 😢
it: Non hai nulla da mangiare 😢
sv: Du har ingenting att äta 😢

# gen_Gen_Error
source: Error: {error}
de: Fehler: {error}
fr: Erreur: {error}
it: Errore: {error}
sv: Fel: {error}

# gen_Confirm_Delete_Title
source: Confirm Deletion
de: Löschung bestätigen
es: Confirmar Eliminación
fr: Confirmer la Suppression
it: Conferma Eliminazione
sv: Bekräfta borttagning

# gen_Confirm_Delete_Message
source: Do you want to delete "{name}"?
de: Möchtest du "{name}" löschen?
es: ¿Quieres eliminar "{name}"?
fr: Voulez-vous supprimer "{name}"?
it: Vuoi eliminare "{name}"?
sv: Vill du ta bort "{name}"?

# gen_Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
sv: Avbryt

# gen_Delete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
sv: Ta bort

source: No Name
de: Ohne Namen
es: Sin Nombre
fr: Sans Nom
it: Senza Nome
sv: Utan namn

# settings_title
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
sv: Inställningar

# settings_theme
source: Theme
de: Design
es: Tema
fr: Thème
it: Tema
sv: Tema

# settings_help
source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Aiuto
sv: Hjälp

# help_title
source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Aiuto
sv: Hjälp

# help_intro
source: Let's see how to make the best use of Cibo.
de: Sehen wir uns an, wie man Cibo am besten nutzt.
es: Veamos cómo utilizar Cibo de la mejor manera.
fr: Voyons comment utiliser au mieux Cibo.
it: Vediamo come utilizzare al meglio Cibo.
sv: Låt oss se hur man använder Cibo på bästa sätt.

# help_step1
source: Start by entering the name of the dish
de: Beginnen wir mit der Eingabe des Gerichtsnamens
es: Empezamos introduciendo el nombre del plato
fr: Commençons par entrer le nom du plat
it: Iniziamo inserendo il nome della pietanza
sv: Börja med att ange namnet på maträtten

# help_step2
source: and immediately we can enter the weight of the container
de: und sofort können wir das Gewicht des Behälters eingeben
es: e inmediatamente podemos introducir el peso del contenedor
fr: et immédiatement nous pouvons entrer le poids du conteneur
it: e subito possiamo inserire il peso del contenitore
sv: och direkt kan vi ange vikten på behållaren

# help_step2_note
source: , with the lid if applicable.
de: , mit Deckel falls vorhanden.
es: , con la tapa si corresponde.
fr: , avec le couvercle si applicable.
it: , con il coperchio se previsto.
sv: , med locket om tillämpligt.

# help_step3
source: At this point, if we don't have everything ready yet, we can save
de: Wenn wir noch nicht alles bereit haben, können wir speichern
es: En este punto, si aún no tenemos todo listo, podemos guardar
fr: À ce stade, si nous n'avons pas encore tout prêt, nous pouvons sauvegarder
it: A questo punto se non abbiamo ancora tutto pronto possiamo salvare
sv: Om vi inte har allt klart än kan vi spara

# help_step3_note
source: and continue once we have prepared the dish.
de: und fortfahren, sobald wir das Gericht zubereitet haben.
es: y continuar una vez que hayamos preparado el plato.
fr: et continuer une fois que nous avons préparé le plat.
it: e proseguire una volta che abbiamo preparato la pietanza.
sv: och fortsätta när vi har förberett maträtten.

# help_step4
source: Once everything is ready, fill the container and weigh it, with the lid if applicable, and enter its total weight
de: Sobald alles bereit ist, füllen wir den Behälter und wiegen ihn, mit Deckel falls vorhanden, und geben sein Gesamtgewicht ein
es: Una vez que todo esté listo, llenamos el contenedor y lo pesamos, con la tapa si corresponde, e introducimos su peso total
fr: Une fois que tout est prêt, remplissons le conteneur et pesons-le, avec le couvercle si applicable, et entrons son poids total
it: Una volta che abbiamo tutto pronto, riempiamo il contenitore e lo pesiamo, con coperchio se previsto, e inseriamo il suo peso totale
sv: När allt är klart, fyll behållaren och väg den, med locket om tillämpligt, och ange dess totalvikt

# help_step5
source: we will see that
de: wir werden sehen, dass
es: veremos que
fr: nous verrons que
it: vedremo che
sv: vi kommer att se att

# help_step5_note
source: is calculated automatically and by changing
de: automatisch berechnet wird und bei Änderung von
es: se calcula automáticamente y al cambiar
fr: est calculé automatiquement et en modifiant
it: si valorizza automaticamente e variandolo
sv: beräknas automatiskt och genom att ändra

# help_step5_end
source: it will update accordingly.
de: entsprechend aktualisiert wird.
es: se actualizará en consecuencia.
fr: il sera mis à jour en conséquence.
it: si aggiornerà di conseguenza.
sv: uppdateras det därefter.

# help_step6
source: At this point we can choose to enter the number of portions
de: Jetzt können wir wählen, ob wir die Anzahl der Portionen eingeben
es: En este punto podemos elegir introducir el número de porciones
fr: À ce stade, nous pouvons choisir d'entrer le nombre de portions
it: A questo punto possiamo scegliere se inserire il nr di porzioni
sv: Nu kan vi välja att ange antalet portioner

# help_step6_note
source: or the weight of a single portion
de: oder das Gewicht einer einzelnen Portion
es: o el peso de una sola porción
fr: ou le poids d'une seule portion
it: o quant'è il peso di una singola porzione
sv: eller vikten på en enskild portion

# help_step6_end
source: , entering one will automatically update the other.
de: , die Eingabe einer aktualisiert automatisch die andere.
es: , al introducir una, la otra se actualizará automáticamente.
fr: , en entrant l'une, l'autre se mettra à jour automatiquement.
it: , inserendone una l'altra si aggiornerà di conseguenza.
sv: , att ange en uppdaterar automatiskt den andra.

# help_step7
source: We can now save everything using the save button
de: Wir können jetzt alles mit der Speichern-Taste speichern
es: Ahora podemos guardar todo usando el botón guardar
fr: Nous pouvons maintenant tout sauvegarder avec le bouton enregistrer
it: Possiamo ora salvare tutto usando il tasto salva
sv: Vi kan nu spara allt med sparaknappen

# help_gnam
source: When we eat our meal, instead of manually changing the values we can use the Gnam button
de: Wenn wir essen, können wir anstatt die Werte manuell zu ändern die Gnam-Taste verwenden
es: Cuando comemos, en lugar de cambiar los valores manualmente podemos usar el botón Gnam
fr: Quand nous mangeons, au lieu de modifier les valeurs manuellement, nous pouvons utiliser le bouton Gnam
it: Quando consumiamo il nostro pasto, anziché modificare i valori a mano possiamo utilizzare il tasto Gnam
sv: När vi äter, istället för att ändra värdena manuellt kan vi använda Gnam-knappen

# help_gnam_note
source: which will remove one portion from the container and update all the data.
de: die eine Portion aus dem Behälter entfernt und alle Daten aktualisiert.
es: que eliminará una porción del contenedor y actualizará todos los datos.
fr: qui supprimera une portion du conteneur et mettra à jour toutes les données.
it: che andrà a rimuovere una porzione dal contenitore e aggiornerà tutti i dati.
sv: som tar bort en portion från behållaren och uppdaterar all data.

# help_thanks
source: Thank you for downloading Cibo.
de: Danke, dass du Cibo heruntergeladen hast.
es: Gracias por descargar Cibo.
fr: Merci d'avoir téléchargé Cibo.
it: Grazie per aver scaricato Cibo.
sv: Tack för att du laddade ner Cibo.

# navTabFridge
source: Fridge
it: Frigo

# navTabContainers
source: Containers
it: Contenitori

# navTabSettings
source: Settings
it: Impostazioni

# containerSetsPageTitle
source: Container Sets
it: Set Contenitori

# containerSetsEmpty
source: No container sets saved yet
it: Nessun set di contenitori salvato

# containerSetsAddTitle
source: Add Container Set
it: Aggiungi Set Contenitore

# containerSetsNameLabel
source: Name
it: Nome

# containerSetsWeightLabel
source: Weight (g)
it: Peso (g)

# containerSetsImageLabel
source: Image
it: Immagine

# containerSetsSaveButton
source: Save
it: Salva

# containerSetsImageCamera
source: Camera
it: Fotocamera

# containerSetsImageGallery
source: Gallery
it: Galleria

# containerSetsImageChoose
source: Choose Image Source
it: Scegli Origine Immagine

# containerSetsWeight
source: Weight: {weight} g
it: Peso: {weight} g

# presetPickerTitle
source: Select a Container
it: Seleziona un Contenitore

# presetPickerEmpty
source: No container presets saved yet. Add them from the Containers tab.
it: Nessun contenitore preimpostato. Aggiungili dalla scheda Contenitori.
